Revit 2026 API

# IndexStreamLine Class

---

A stream that can be used to write IndexLine primitives into an IndexBuffer

SystemObject Autodesk.Revit.DB.DirectContext3DIndexStream Autodesk.Revit.DB.DirectContext3DIndexStreamLine

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexStreamLine : IndexStream
```
```vb
Public Class IndexStreamLine
	Inherits IndexStream
```
```cpp
public ref class IndexStreamLine : public IndexStream
```
```fsharp
type IndexStreamLine =
    class
        inherit IndexStream
    end
```

The IndexStreamLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexStream) |

|  | Name | Description |
| --- | --- | --- |
|  | AddLine | Inserts a IndexLine segment into the stream and associated buffer. |
|  | AddLines |  |
|  | Dispose | (Inherited from IndexStream) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace